{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Import libs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pathlib"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create connection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Neo4jConnection:\n",
    "    def __init__(self, uri, user, pwd):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def query(self, query, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try: \n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n",
    "            response = list(session.run(query))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session is not None:\n",
    "                session.close()\n",
    "                \n",
    "        return response\n",
    "conn = Neo4jConnection(uri=\"bolt://localhost:7687\", user=\"neo4j\", pwd=\"vovse\")\n",
    "relpath = pathlib.Path().absolute().as_uri()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Import data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Delete everything in graph\n",
    "query = '''MATCH (n) DETACH DELETE n'''\n",
    "out = conn.query(query)\n",
    "\n",
    "# User data\n",
    "query = '''\n",
    "CALL apoc.load.json('%s/../jsondata/0001-users.json') YIELD value\n",
    "UNWIND value.users AS u\n",
    "MERGE (domainUser:DomainUser {sid:u.SID})\n",
    "SET domainUser += u.Properties\n",
    "''' % relpath\n",
    "out = conn.query(query)\n",
    "\n",
    "# Group data - DC local groups\n",
    "query = '''\n",
    "CALL apoc.load.json('%s/../jsondata/0001-groups.json') YIELD value\n",
    "UNWIND value.groups AS g\n",
    "WITH g WHERE g.type = 'LocalGroup'\n",
    "MERGE (localGroup:LocalGroup {sid:g.SID, computerName:g.Properties.domain})\n",
    "SET localGroup += g.Properties\n",
    "WITH g, localGroup\n",
    "UNWIND g.members AS mb\n",
    "FOREACH (_ IN case when mb.type = 'LocalGroup' then [1] else [] end|\n",
    "\tMERGE (localSubGroup:LocalGroup {sid:mb.SID, computerName:g.Properties.domain})\n",
    "\tMERGE (localGroup)-[:hasMember]->(localSubGroup)\n",
    ")\n",
    "FOREACH (_ IN case when mb.type = 'DomainUser' then [1] else [] end|\n",
    "\tMERGE (domainUser:DomainUser {sid:mb.SID})\n",
    "\tMERGE (localGroup)-[:hasMember]->(domainUser)\n",
    ")\n",
    "FOREACH (_ IN case when mb.type = 'DomainGroup' then [1] else [] end|\n",
    "\tMERGE (domainGroup:DomainGroup {sid:mb.SID})\n",
    "\tMERGE (localGroup)-[:hasMember]->(domainGroup)\n",
    ")\n",
    "''' % relpath\n",
    "out = conn.query(query)\n",
    "\n",
    "# Group data - domain groups\n",
    "query = '''\n",
    "CALL apoc.load.json('%s/../jsondata/0001-groups.json') YIELD value\n",
    "UNWIND value.groups AS g\n",
    "WITH g WHERE g.type = 'DomainGroup'\n",
    "MERGE (domainGroup:DomainGroup {sid:g.SID})\n",
    "SET domainGroup += g.Properties\n",
    "WITH g, domainGroup\n",
    "UNWIND g.members AS mb\n",
    "FOREACH (_ IN case when mb.type = 'LocalGroup' then [1] else [] end|\n",
    "    MERGE (localGroup:LocalGroup {sid:mb.SID, computerName:g.Properties.domain})\n",
    "    MERGE (domainGroup)-[:hasMember]->(localGroup)\n",
    ")\n",
    "FOREACH (_ IN case when mb.type = 'DomainUser' then [1] else [] end|\n",
    "    MERGE (domainUser:DomainUser {sid:mb.SID})\n",
    "    MERGE (domainGroup)-[:hasMember]->(domainUser)\n",
    ")\n",
    "FOREACH (_ IN case when mb.type = 'DomainGroup' then [1] else [] end|\n",
    "    MERGE (domainSubGroup:DomainGroup {sid:mb.SID})\n",
    "    MERGE (domainGroup)-[:hasMember]->(domainSubGroup)\n",
    ")\n",
    "''' % relpath \n",
    "out = conn.query(query)\n",
    "\n",
    "# Computer data\n",
    "query = '''\n",
    "CALL apoc.load.json('%s/../jsondata/0001-computers.json') YIELD value\n",
    "UNWIND value.computers AS c\n",
    "MERGE (computer:Computer {sid:c.SID})\n",
    "SET computer += c.Properties\n",
    "\n",
    "// Local users\n",
    "WITH c, computer\n",
    "UNWIND c.LocalUsers AS lu\n",
    "MERGE (localUser:LocalUser {name:lu.name, sid:lu.SID, computerName:computer.name})\n",
    "MERGE (computer)-[:hasUser]->(localUser)\n",
    "\n",
    "// Local groups\n",
    "WITH c, computer\n",
    "UNWIND c.LocalGroups AS lg\n",
    "MERGE (localGroup:LocalGroup {name:lg.name, sid:lg.SID, computerName:computer.name})\n",
    "MERGE (computer)-[:hasGroup]->(localGroup)\n",
    "\n",
    "// Local group members\n",
    "WITH lg, localGroup, c, computer\n",
    "UNWIND lg.members AS mb\n",
    "FOREACH (_ IN case when mb.type = 'LocalGroup' then [1] else [] end|\n",
    "\tMERGE (localSubGroup:LocalGroup {name:mb.name, sid:mb.SID, computerName:computer.name})\n",
    "\tMERGE (computer)-[:hasGroup]->(localSubGroup)\n",
    "\tMERGE (localGroup)-[:hasMember]->(localSubGroup)\n",
    ")\n",
    "FOREACH (_ IN case when mb.type = 'LocalUser' then [1] else [] end|\n",
    "\tMERGE (localUser:LocalUser {name:mb.name, sid:mb.SID, computerName:computer.name})\n",
    "\tMERGE (computer)-[:hasUser]->(localUser)\n",
    "\tMERGE (localGroup)-[:hasMember]->(localUser)\n",
    ")\n",
    "FOREACH (_ IN case when mb.type = 'DomainUser' then [1] else [] end|\n",
    "\tMERGE (domainUser:DomainUser {sid:mb.SID})\n",
    "\tMERGE (localGroup)-[:hasMember]->(domainUser)\n",
    ")\n",
    "FOREACH (_ IN case when mb.type = 'DomainGroup' then [1] else [] end|\n",
    "\tMERGE (domainGroup:DomainGroup {sid:mb.SID})\n",
    "\tMERGE (localGroup)-[:hasMember]->(domainGroup)\n",
    ")\n",
    "\n",
    "// URA\n",
    "WITH c, computer\n",
    "UNWIND c.URA AS ura\n",
    "FOREACH (principal IN ura.principals |\n",
    "    FOREACH (_ IN case when principal.type = 'LocalGroup' then [1] else [] end|\n",
    "        MERGE (localGroup:LocalGroup {name:principal.name, sid:principal.SID, computerName:computer.name})\n",
    "        MERGE (localGroup)-[:hasRight {name:ura.right}]->(computer)\n",
    "    )\n",
    "    FOREACH (_ IN case when principal.type = 'LocalUser' then [1] else [] end|\n",
    "        MERGE (localUser:LocalUser {name:principal.name, sid:principal.SID, computerName:computer.name})\n",
    "        MERGE (localUser)-[:hasRight {name:ura.right}]->(computer)\n",
    "    )\n",
    "    FOREACH (_ IN case when principal.type = 'DomainUser' then [1] else [] end|\n",
    "        MERGE (domainUser:DomainUser {sid:principal.SID})\n",
    "        MERGE (domainUser)-[:hasRight {name:ura.right}]->(computer)\n",
    "    )\n",
    "    FOREACH (_ IN case when principal.type = 'DomainGroup' then [1] else [] end|\n",
    "        MERGE (domainGroup:DomainGroup {sid:principal.SID})\n",
    "        MERGE (domainGroup)-[:hasRight {name:ura.right}]->(computer)\n",
    "    )\n",
    ")\n",
    "''' % relpath \n",
    "out = conn.query(query)\n",
    "\n",
    "# OU data\n",
    "query = '''\n",
    "CALL apoc.load.json('%s/../jsondata/0001-ous.json') YIELD value\n",
    "UNWIND value.ous AS o\n",
    "CREATE (ou:OU {GUID:o.ObjectGUID, domain:o.Properties.domain})\n",
    "SET ou += o.Properties\n",
    "WITH o, ou\n",
    "UNWIND o.Principals AS principal\n",
    "FOREACH (_ IN case when principal.type = 'LocalUser' then [1] else [] end|\n",
    "\tMERGE (localUser:LocalUser {sid:principal.SID, computerName:o.Properties.domain})\n",
    "\tMERGE (ou)-[:ouContains]->(localUser)\n",
    ")\n",
    "FOREACH (_ IN case when principal.type = 'LocalGroup' then [1] else [] end|\n",
    "\tMERGE (localGroup:LocalGroup {sid:principal.SID, computerName:o.Properties.domain})\n",
    "\tMERGE (ou)-[:ouContains]->(localGroup)\n",
    ")\n",
    "FOREACH (_ IN case when principal.type = 'DomainUser' then [1] else [] end|\n",
    "\tMERGE (domainUser:DomainUser {sid:principal.SID})\n",
    "\tMERGE (ou)-[:ouContains]->(domainUser)\n",
    ")\n",
    "FOREACH (_ IN case when principal.type = 'DomainGroup' then [1] else [] end|\n",
    "\tMERGE (domainGroup:DomainGroup {sid:principal.SID})\n",
    "\tMERGE (ou)-[:ouContains]->(domainGroup)\n",
    ")\n",
    "FOREACH (_ IN case when principal.type = 'Computer' then [1] else [] end|\n",
    "\tMERGE (computer:Computer {sid:principal.SID})\n",
    "\tMERGE (ou)-[:ouContains]->(computer)\n",
    ")\n",
    "''' % relpath\n",
    "out = conn.query(query)\n",
    "\n",
    "# Connect DC groups to DCs\n",
    "query = '''\n",
    "MATCH (dc:Computer) WHERE dc.PrimaryGroupSid ENDS WITH '-516'\n",
    "WITH dc\n",
    "MATCH (dcGroup:LocalGroup) WHERE dcGroup.domain = dc.domain\n",
    "MERGE (dc)-[:hasGroup]->(dcGroup)\n",
    "'''\n",
    "out = conn.query(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get all data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record n=<Node id=12 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-11'}>>,\n",
       " <Record n=<Node id=13 labels=frozenset({'LocalGroup'}) properties={'name': 'ADMINISTRATORS@HOT.LOCAL', 'description': 'Administrators have complete and unrestricted access to the computer/domain', 'distinguishedname': 'CN=Administrators,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-544'}>>,\n",
       " <Record n=<Node id=14 labels=frozenset({'LocalGroup'}) properties={'name': 'IIS_IUSRS@HOT.LOCAL', 'description': 'Built-in group used by Internet Information Services.', 'distinguishedname': 'CN=IIS_IUSRS,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-568'}>>,\n",
       " <Record n=<Node id=15 labels=frozenset({'LocalGroup'}) properties={'name': 'CRYPTOGRAPHIC OPERATORS@HOT.LOCAL', 'description': 'Members are authorized to perform cryptographic operations.', 'distinguishedname': 'CN=Cryptographic Operators,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-569'}>>,\n",
       " <Record n=<Node id=16 labels=frozenset({'LocalGroup'}) properties={'name': 'REPLICATORS@HOT.LOCAL', 'description': 'Supports file replication in a domain', 'distinguishedname': 'CN=Replicator,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-552'}>>,\n",
       " <Record n=<Node id=17 labels=frozenset({'LocalGroup'}) properties={'name': 'RDS MANAGEMENT SERVERS@HOT.LOCAL', 'description': 'Servers in this group can perform routine administrative actions on servers running Remote Desktop Services. This group needs to be populated on all servers in a Remote Desktop Services deployment. The servers running the RDS Central Management service must be included in this group.', 'distinguishedname': 'CN=RDS Management Servers,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-577'}>>,\n",
       " <Record n=<Node id=18 labels=frozenset({'LocalGroup'}) properties={'name': 'REMOTE MANAGEMENT USERS@HOT.LOCAL', 'description': 'Members of this group can access WMI resources over management protocols (such as WS-Management via the Windows Remote Management service). This applies only to WMI namespaces that grant access to the user.', 'distinguishedname': 'CN=Remote Management Users,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-580'}>>,\n",
       " <Record n=<Node id=19 labels=frozenset({'LocalGroup'}) properties={'name': 'ACCOUNT OPERATORS@HOT.LOCAL', 'description': 'Members can administer domain user and group accounts', 'distinguishedname': 'CN=Account Operators,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-548'}>>,\n",
       " <Record n=<Node id=20 labels=frozenset({'LocalGroup'}) properties={'name': 'SERVER OPERATORS@HOT.LOCAL', 'description': 'Members can administer domain servers', 'distinguishedname': 'CN=Server Operators,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-549'}>>,\n",
       " <Record n=<Node id=21 labels=frozenset({'LocalGroup'}) properties={'name': 'TERMINAL SERVER LICENSE SERVERS@HOT.LOCAL', 'description': 'Members of this group can update user accounts in Active Directory with information about license issuance, for the purpose of tracking and reporting TS Per User CAL usage', 'distinguishedname': 'CN=Terminal Server License Servers,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-561'}>>,\n",
       " <Record n=<Node id=22 labels=frozenset({'LocalGroup'}) properties={'name': 'PRE-WINDOWS 2000 COMPATIBLE ACCESS@HOT.LOCAL', 'description': 'A backward compatibility group which allows read access on all users and groups in the domain', 'distinguishedname': 'CN=Pre-Windows 2000 Compatible Access,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-554'}>>,\n",
       " <Record n=<Node id=23 labels=frozenset({'LocalGroup'}) properties={'name': 'GUESTS@HOT.LOCAL', 'description': 'Guests have the same access as members of the Users group by default, except for the Guest account which is further restricted', 'distinguishedname': 'CN=Guests,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-546'}>>,\n",
       " <Record n=<Node id=24 labels=frozenset({'LocalGroup'}) properties={'name': 'USERS@HOT.LOCAL', 'description': 'Users are prevented from making accidental or intentional system-wide changes and can run most applications', 'distinguishedname': 'CN=Users,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-545'}>>,\n",
       " <Record n=<Node id=25 labels=frozenset({'LocalGroup'}) properties={'name': 'WINDOWS AUTHORIZATION ACCESS GROUP@HOT.LOCAL', 'description': 'Members of this group have access to the computed tokenGroupsGlobalAndUniversal attribute on User objects', 'distinguishedname': 'CN=Windows Authorization Access Group,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-560'}>>,\n",
       " <Record n=<Node id=26 labels=frozenset({'LocalGroup'}) properties={'name': 'INCOMING FOREST TRUST BUILDERS@HOT.LOCAL', 'description': 'Members of this group can create incoming, one-way trusts to this forest', 'distinguishedname': 'CN=Incoming Forest Trust Builders,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-557'}>>,\n",
       " <Record n=<Node id=27 labels=frozenset({'LocalGroup'}) properties={'name': 'HYPER-V ADMINISTRATORS@HOT.LOCAL', 'description': 'Members of this group have complete and unrestricted access to all features of Hyper-V.', 'distinguishedname': 'CN=Hyper-V Administrators,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-578'}>>,\n",
       " <Record n=<Node id=28 labels=frozenset({'LocalGroup'}) properties={'name': 'PERFORMANCE LOG USERS@HOT.LOCAL', 'description': 'Members of this group may schedule logging of performance counters, enable trace providers, and collect event traces both locally and via remote access to this computer', 'distinguishedname': 'CN=Performance Log Users,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-559'}>>,\n",
       " <Record n=<Node id=29 labels=frozenset({'LocalGroup'}) properties={'name': 'RDS REMOTE ACCESS SERVERS@HOT.LOCAL', 'description': 'Servers in this group enable users of RemoteApp programs and personal virtual desktops access to these resources. In Internet-facing deployments, these servers are typically deployed in an edge network. This group needs to be populated on servers running RD Connection Broker. RD Gateway servers and RD Web Access servers used in the deployment need to be in this group.', 'distinguishedname': 'CN=RDS Remote Access Servers,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-575'}>>,\n",
       " <Record n=<Node id=30 labels=frozenset({'LocalGroup'}) properties={'name': 'CERTIFICATE SERVICE DCOM ACCESS@HOT.LOCAL', 'description': 'Members of this group are allowed to connect to Certification Authorities in the enterprise', 'distinguishedname': 'CN=Certificate Service DCOM Access,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-574'}>>,\n",
       " <Record n=<Node id=31 labels=frozenset({'LocalGroup'}) properties={'name': 'ACCESS CONTROL ASSISTANCE OPERATORS@HOT.LOCAL', 'description': 'Members of this group can remotely query authorization attributes and permissions for resources on this computer.', 'distinguishedname': 'CN=Access Control Assistance Operators,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-579'}>>,\n",
       " <Record n=<Node id=32 labels=frozenset({'LocalGroup'}) properties={'name': 'PRINT OPERATORS@HOT.LOCAL', 'description': 'Members can administer printers installed on domain controllers', 'distinguishedname': 'CN=Print Operators,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-550'}>>,\n",
       " <Record n=<Node id=33 labels=frozenset({'LocalGroup'}) properties={'name': 'PERFORMANCE MONITOR USERS@HOT.LOCAL', 'description': 'Members of this group can access performance counter data locally and remotely', 'distinguishedname': 'CN=Performance Monitor Users,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-558'}>>,\n",
       " <Record n=<Node id=34 labels=frozenset({'LocalGroup'}) properties={'name': 'NETWORK CONFIGURATION OPERATORS@HOT.LOCAL', 'description': 'Members in this group can have some administrative privileges to manage configuration of networking features', 'distinguishedname': 'CN=Network Configuration Operators,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-556'}>>,\n",
       " <Record n=<Node id=35 labels=frozenset({'LocalGroup'}) properties={'name': 'REMOTE DESKTOP USERS@HOT.LOCAL', 'description': 'Members in this group are granted the right to logon remotely', 'distinguishedname': 'CN=Remote Desktop Users,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-555'}>>,\n",
       " <Record n=<Node id=36 labels=frozenset({'LocalGroup'}) properties={'name': 'EVENT LOG READERS@HOT.LOCAL', 'description': 'Members of this group can read event logs from local machine', 'distinguishedname': 'CN=Event Log Readers,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-573'}>>,\n",
       " <Record n=<Node id=37 labels=frozenset({'LocalGroup'}) properties={'name': 'RDS ENDPOINT SERVERS@HOT.LOCAL', 'description': 'Servers in this group run virtual machines and host sessions where users RemoteApp programs and personal virtual desktops run. This group needs to be populated on servers running RD Connection Broker. RD Session Host servers and RD Virtualization Host servers used in the deployment need to be in this group.', 'distinguishedname': 'CN=RDS Endpoint Servers,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-576'}>>,\n",
       " <Record n=<Node id=38 labels=frozenset({'LocalGroup'}) properties={'name': 'BACKUP OPERATORS@HOT.LOCAL', 'description': 'Backup Operators can override security restrictions for the sole purpose of backing up or restoring files', 'distinguishedname': 'CN=Backup Operators,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-551'}>>,\n",
       " <Record n=<Node id=39 labels=frozenset({'LocalGroup'}) properties={'name': 'DISTRIBUTED COM USERS@HOT.LOCAL', 'description': 'Members are allowed to launch, activate and use Distributed COM objects on this machine.', 'distinguishedname': 'CN=Distributed COM Users,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-562'}>>,\n",
       " <Record n=<Node id=40 labels=frozenset({'LocalGroup'}) properties={'name': 'ENTERPRISE DOMAIN CONTROLLERS@HOT.LOCAL', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-9'}>>,\n",
       " <Record n=<Node id=41 labels=frozenset({'LocalGroup'}) properties={'name': 'EVERYONE@HOT.LOCAL', 'sid': 'S-1-1-0'}>>,\n",
       " <Record n=<Node id=42 labels=frozenset({'LocalGroup'}) properties={'name': 'AUTHENTICATED USERS@HOT.LOCAL', 'sid': 'S-1-5-11'}>>,\n",
       " <Record n=<Node id=43 labels=frozenset({'Computer'}) properties={'PrimaryGroupSid': 'S-1-5-21-3712873460-3785406585-1658148875-515', 'haslaps': False, 'operatingsystem': 'Windows Server 2019 Datacenter Evaluation', 'unconstraineddelegation': False, 'enabled': True, 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-1111', 'tier': 1, 'domain': 'HOT.LOCAL', 'pwdlastset': 1592308245, 'name': 'HOT-JUMPHOST.HOT.LOCAL', 'distinguishedname': 'CN=HOT-JUMPHOST,OU=Jumphost,DC=hot,DC=local', 'serviceprincipalnames': ['WSMAN/hot-jumphost', 'WSMAN/hot-jumphost.hot.local', 'TERMSRV/HOT-JUMPHOST', 'TERMSRV/hot-jumphost.hot.local', 'RestrictedKrbHost/HOT-JUMPHOST', 'HOST/HOT-JUMPHOST', 'RestrictedKrbHost/hot-jumphost.hot.local', 'HOST/hot-jumphost.hot.local'], 'lastlogontimestamp': 1592307353}>>,\n",
       " <Record n=<Node id=44 labels=frozenset({'Computer'}) properties={'PrimaryGroupSid': 'S-1-5-21-3712873460-3785406585-1658148875-515', 'haslaps': False, 'operatingsystem': 'Windows Server 2019 Datacenter Evaluation', 'unconstraineddelegation': False, 'enabled': True, 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-1112', 'tier': 1, 'domain': 'HOT.LOCAL', 'pwdlastset': 1592308245, 'name': 'SERVER.HOT.LOCAL', 'distinguishedname': 'CN=SERVER,OU=Jumphost,DC=hot,DC=local', 'serviceprincipalnames': ['WSMAN/server', 'WSMAN/server.hot.local', 'TERMSRV/SERVER', 'TERMSRV/server.hot.local', 'RestrictedKrbHost/SERVER', 'HOST/SERVER', 'RestrictedKrbHost/server.hot.local', 'HOST/server.hot.local'], 'lastlogontimestamp': 1592307353}>>,\n",
       " <Record n=<Node id=45 labels=frozenset({'LocalUser'}) properties={'name': 'Administrator', 'computerName': 'HOT-JUMPHOST.HOT.LOCAL', 'sid': 'HOT-JUMPHOST-500'}>>,\n",
       " <Record n=<Node id=46 labels=frozenset({'LocalUser'}) properties={'name': 'Administrator', 'computerName': 'SERVER.HOT.LOCAL', 'sid': 'SERVER-SID-500'}>>,\n",
       " <Record n=<Node id=47 labels=frozenset({'LocalGroup'}) properties={'name': 'Remote Desktop Users', 'computerName': 'HOT-JUMPHOST.HOT.LOCAL', 'sid': 'S-1-5-32-555'}>>,\n",
       " <Record n=<Node id=48 labels=frozenset({'LocalGroup'}) properties={'name': 'Administrators', 'computerName': 'HOT-JUMPHOST.HOT.LOCAL', 'sid': 'S-1-5-32-544'}>>,\n",
       " <Record n=<Node id=49 labels=frozenset({'LocalGroup'}) properties={'name': 'Remote Management Users', 'computerName': 'HOT-JUMPHOST.HOT.LOCAL', 'sid': 'S-1-5-32-580'}>>,\n",
       " <Record n=<Node id=50 labels=frozenset({'LocalGroup'}) properties={'name': 'Remote Desktop Users', 'computerName': 'SERVER.HOT.LOCAL', 'sid': 'S-1-5-32-555'}>>,\n",
       " <Record n=<Node id=51 labels=frozenset({'LocalGroup'}) properties={'name': 'Administrators', 'computerName': 'SERVER.HOT.LOCAL', 'sid': 'S-1-5-32-544'}>>,\n",
       " <Record n=<Node id=52 labels=frozenset({'LocalGroup'}) properties={'name': 'Remote Management Users', 'computerName': 'SERVER.HOT.LOCAL', 'sid': 'S-1-5-32-580'}>>,\n",
       " <Record n=<Node id=53 labels=frozenset({'DomainGroup'}) properties={'name': 'Domain Users', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-513'}>>,\n",
       " <Record n=<Node id=54 labels=frozenset({'DomainUser'}) properties={'sidhistory': [], 'passwordnotreqd': False, 'description': 'Key Distribution Center Service Account', 'sensitive': False, 'unconstraineddelegation': False, 'pwdneverexpires': False, 'enabled': False, 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-502', 'domain': 'HOT.LOCAL', 'pwdlastset': 1582489462, 'name': 'KRBTGT@HOT.LOCAL', 'lastlogon': -1, 'distinguishedname': 'CN=krbtgt,CN=Users,DC=hot,DC=local', 'serviceprincipalnames': ['kadmin/changepw'], 'admincount': True, 'lastlogontimestamp': -1, 'dontreqpreauth': False}>>,\n",
       " <Record n=<Node id=55 labels=frozenset({'DomainUser'}) properties={'sidhistory': [], 'passwordnotreqd': False, 'sensitive': False, 'unconstraineddelegation': False, 'pwdneverexpires': False, 'enabled': True, 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2115', 'domain': 'HOT.LOCAL', 'pwdlastset': 1594981880, 'displayname': 'TEST Bo Jesen', 'name': 'TESTBJ@HOT.LOCAL', 'lastlogon': -1, 'serviceprincipalnames': [], 'distinguishedname': 'CN=TEST Bo Jesen,CN=Users,DC=hot,DC=local', 'admincount': True, 'lastlogontimestamp': -1, 'dontreqpreauth': False}>>,\n",
       " <Record n=<Node id=56 labels=frozenset({'DomainUser'}) properties={'sidhistory': [], 'passwordnotreqd': False, 'sensitive': False, 'unconstraineddelegation': False, 'pwdneverexpires': False, 'enabled': True, 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2116', 'pwdlastset': -1, 'domain': 'HOT.LOCAL', 'displayname': 'TEST Bjarne Corydon', 'name': 'TESTBC@HOT.LOCAL', 'lastlogon': -1, 'distinguishedname': 'CN=TEST Bjarne Corydon,CN=Users,DC=hot,DC=local', 'serviceprincipalnames': [], 'admincount': False, 'lastlogontimestamp': -1, 'dontreqpreauth': False}>>,\n",
       " <Record n=<Node id=57 labels=frozenset({'DomainUser'}) properties={'sidhistory': [], 'passwordnotreqd': False, 'sensitive': False, 'unconstraineddelegation': False, 'pwdneverexpires': False, 'enabled': True, 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2142', 'domain': 'HOT.LOCAL', 'pwdlastset': 1596704737, 'displayname': 'tenpw', 'name': 'TENPW@HOT.LOCAL', 'lastlogon': -1, 'serviceprincipalnames': [], 'distinguishedname': 'CN=tenpw,CN=Users,DC=hot,DC=local', 'admincount': False, 'lastlogontimestamp': -1, 'dontreqpreauth': False}>>,\n",
       " <Record n=<Node id=58 labels=frozenset({'DomainUser'}) properties={'sidhistory': [], 'passwordnotreqd': False, 'description': 'Built-in account for administering the computer/domain', 'sensitive': False, 'unconstraineddelegation': False, 'pwdneverexpires': False, 'enabled': True, 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-500', 'pwdlastset': 1596701372, 'domain': 'HOT.LOCAL', 'name': 'ADMINISTRATOR@HOT.LOCAL', 'lastlogon': 1598280316, 'distinguishedname': 'CN=Administrator,CN=Users,DC=hot,DC=local', 'serviceprincipalnames': [], 'admincount': True, 'lastlogontimestamp': 1597648108, 'dontreqpreauth': False}>>,\n",
       " <Record n=<Node id=59 labels=frozenset({'DomainUser'}) properties={'sidhistory': [], 'passwordnotreqd': False, 'sensitive': False, 'unconstraineddelegation': False, 'pwdneverexpires': False, 'enabled': True, 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-1112', 'domain': 'HOT.LOCAL', 'pwdlastset': 1593003501, 'displayname': 'Mick Jagger', 'name': 'MJ@HOT.LOCAL', 'lastlogon': 1600336234, 'serviceprincipalnames': [], 'distinguishedname': 'CN=Mick Jagger,CN=Users,DC=hot,DC=local', 'admincount': True, 'lastlogontimestamp': 1600274986, 'dontreqpreauth': False}>>,\n",
       " <Record n=<Node id=60 labels=frozenset({'DomainUser'}) properties={'sidhistory': [], 'passwordnotreqd': False, 'sensitive': False, 'unconstraineddelegation': False, 'pwdneverexpires': False, 'enabled': True, 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2151', 'domain': 'HOT.LOCAL', 'pwdlastset': 1600001088, 'displayname': 'domain admin', 'name': 'DOMAIN-ADMIN@HOT.LOCAL', 'lastlogon': 1600020313, 'serviceprincipalnames': [], 'distinguishedname': 'CN=domain admin,CN=Users,DC=hot,DC=local', 'admincount': True, 'lastlogontimestamp': 1600001824, 'dontreqpreauth': False}>>,\n",
       " <Record n=<Node id=61 labels=frozenset({'DomainUser'}) properties={'sidhistory': [], 'passwordnotreqd': False, 'sensitive': True, 'unconstraineddelegation': False, 'pwdneverexpires': False, 'enabled': True, 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2139', 'pwdlastset': -1, 'domain': 'HOT.LOCAL', 'displayname': 'Tier 1 Bo Jesen', 'name': 'T1_BJ@HOT.LOCAL', 'lastlogon': -1, 'distinguishedname': 'CN=Tier 1 Bo Jesen,CN=Users,DC=hot,DC=local', 'serviceprincipalnames': [], 'admincount': True, 'lastlogontimestamp': -1, 'dontreqpreauth': False}>>,\n",
       " <Record n=<Node id=62 labels=frozenset({'DomainUser'}) properties={'sidhistory': [], 'passwordnotreqd': False, 'description': 'Account created by Microsoft Azure Active Directory Connect with installation identifier f347c6e9671743b2ab38c51a8fc0201f running on computer HOT-DC-01 configured to synchronize to tenant hotad.onmicrosoft.com. This account must have directory replication permissions in the local Active Directory and write permission on certain attributes to enable Hybrid Deployment.', 'sensitive': False, 'unconstraineddelegation': False, 'pwdneverexpires': True, 'enabled': True, 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2107', 'pwdlastset': 1589207646, 'domain': 'HOT.LOCAL', 'name': 'MSOL_F347C6E96717@HOT.LOCAL', 'lastlogon': 1599584840, 'distinguishedname': 'CN=MSOL_f347c6e96717,CN=Users,DC=hot,DC=local', 'serviceprincipalnames': [], 'admincount': False, 'lastlogontimestamp': 1599381758, 'dontreqpreauth': False}>>,\n",
       " <Record n=<Node id=63 labels=frozenset({'DomainUser'}) properties={'sidhistory': [], 'passwordnotreqd': False, 'sensitive': False, 'unconstraineddelegation': False, 'pwdneverexpires': False, 'enabled': True, 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2117', 'pwdlastset': 1594988805, 'domain': 'HOT.LOCAL', 'displayname': 'TEST Michael Laudrup', 'name': 'TESTMJ@HOT.LOCAL', 'lastlogon': -1, 'distinguishedname': 'CN=TEST Michael Laudrup,CN=Users,DC=hot,DC=local', 'serviceprincipalnames': [], 'admincount': False, 'lastlogontimestamp': -1, 'dontreqpreauth': False}>>,\n",
       " <Record n=<Node id=64 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-544'}>>,\n",
       " <Record n=<Node id=65 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-568'}>>,\n",
       " <Record n=<Node id=66 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-569'}>>,\n",
       " <Record n=<Node id=67 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-552'}>>,\n",
       " <Record n=<Node id=68 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-577'}>>,\n",
       " <Record n=<Node id=69 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-580'}>>,\n",
       " <Record n=<Node id=70 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-548'}>>,\n",
       " <Record n=<Node id=71 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-549'}>>,\n",
       " <Record n=<Node id=72 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-561'}>>,\n",
       " <Record n=<Node id=73 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-554'}>>,\n",
       " <Record n=<Node id=74 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-546'}>>,\n",
       " <Record n=<Node id=75 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-545'}>>,\n",
       " <Record n=<Node id=76 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-560'}>>,\n",
       " <Record n=<Node id=77 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-557'}>>,\n",
       " <Record n=<Node id=78 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-578'}>>,\n",
       " <Record n=<Node id=79 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-559'}>>,\n",
       " <Record n=<Node id=80 labels=frozenset({'DomainGroup'}) properties={'name': 'SCHEMA ADMINS@HOT.LOCAL', 'description': 'Designated administrators of the schema', 'distinguishedname': 'CN=Schema Admins,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-518'}>>,\n",
       " <Record n=<Node id=81 labels=frozenset({'DomainGroup'}) properties={'name': 'ENTERPRISE ADMINS@HOT.LOCAL', 'description': 'Designated administrators of the enterprise', 'distinguishedname': 'CN=Enterprise Admins,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-519'}>>,\n",
       " <Record n=<Node id=82 labels=frozenset({'DomainGroup'}) properties={'name': 'DOMAIN ADMINS@HOT.LOCAL', 'description': 'Designated administrators of the domain', 'distinguishedname': 'CN=Domain Admins,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-512'}>>,\n",
       " <Record n=<Node id=83 labels=frozenset({'DomainGroup'}) properties={'name': 'STORAGE REPLICA ADMINISTRATORS@HOT.LOCAL', 'description': 'Members of this group have complete and unrestricted access to all features of Storage Replica.', 'distinguishedname': 'CN=Storage Replica Administrators,CN=Builtin,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-32-582'}>>,\n",
       " <Record n=<Node id=84 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-575'}>>,\n",
       " <Record n=<Node id=85 labels=frozenset({'DomainGroup'}) properties={'name': 'BLA-DESKTOP-4V2TID2@HOT.LOCAL', 'distinguishedname': 'CN=bla-DESKTOP-4V2TID2,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2112'}>>,\n",
       " <Record n=<Node id=86 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-574'}>>,\n",
       " <Record n=<Node id=87 labels=frozenset({'DomainGroup'}) properties={'name': 'ADSYNCPASSWORDSET@HOT.LOCAL', 'description': 'ADSyncPasswordSet', 'distinguishedname': 'CN=ADSyncPasswordSet,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2106'}>>,\n",
       " <Record n=<Node id=88 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-579'}>>,\n",
       " <Record n=<Node id=89 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-550'}>>,\n",
       " <Record n=<Node id=90 labels=frozenset({'DomainGroup'}) properties={'name': 'DOMAIN CONTROLLERS@HOT.LOCAL', 'description': 'All domain controllers in the domain', 'distinguishedname': 'CN=Domain Controllers,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-516'}>>,\n",
       " <Record n=<Node id=91 labels=frozenset({'DomainGroup'}) properties={'name': 'READ-ONLY DOMAIN CONTROLLERS@HOT.LOCAL', 'description': 'Members of this group are Read-Only Domain Controllers in the domain', 'distinguishedname': 'CN=Read-only Domain Controllers,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-521'}>>,\n",
       " <Record n=<Node id=92 labels=frozenset({'DomainGroup'}) properties={'name': 'PAW_ADMINS@HOT.LOCAL', 'distinguishedname': 'CN=PAW_Admins,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2114'}>>,\n",
       " <Record n=<Node id=93 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-558'}>>,\n",
       " <Record n=<Node id=94 labels=frozenset({'DomainGroup'}) properties={'name': 'ENTERPRISE KEY ADMINS@HOT.LOCAL', 'description': 'Members of this group can perform administrative actions on key objects within the forest.', 'distinguishedname': 'CN=Enterprise Key Admins,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-527'}>>,\n",
       " <Record n=<Node id=95 labels=frozenset({'DomainGroup'}) properties={'name': 'KEY ADMINS@HOT.LOCAL', 'description': 'Members of this group can perform administrative actions on key objects within the domain.', 'distinguishedname': 'CN=Key Admins,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-526'}>>,\n",
       " <Record n=<Node id=96 labels=frozenset({'DomainGroup'}) properties={'name': 'DOMAIN GUESTS@HOT.LOCAL', 'description': 'All domain guests', 'distinguishedname': 'CN=Domain Guests,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-514'}>>,\n",
       " <Record n=<Node id=97 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-556'}>>,\n",
       " <Record n=<Node id=98 labels=frozenset({'DomainGroup'}) properties={'name': 'GROUP POLICY CREATOR OWNERS@HOT.LOCAL', 'description': 'Members in this group can modify group policy for the domain', 'distinguishedname': 'CN=Group Policy Creator Owners,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-520'}>>,\n",
       " <Record n=<Node id=99 labels=frozenset({'DomainGroup'}) properties={'name': 'ENTERPRISE READ-ONLY DOMAIN CONTROLLERS@HOT.LOCAL', 'description': 'Members of this group are Read-Only Domain Controllers in the enterprise', 'distinguishedname': 'CN=Enterprise Read-only Domain Controllers,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-498'}>>,\n",
       " <Record n=<Node id=100 labels=frozenset({'DomainGroup'}) properties={'name': 'CLONEABLE DOMAIN CONTROLLERS@HOT.LOCAL', 'description': 'Members of this group that are domain controllers may be cloned.', 'distinguishedname': 'CN=Cloneable Domain Controllers,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-522'}>>,\n",
       " <Record n=<Node id=101 labels=frozenset({'DomainGroup'}) properties={'name': 'PROTECTED USERS@HOT.LOCAL', 'description': 'Members of this group are afforded additional protections against authentication security threats. See http://go.microsoft.com/fwlink/?LinkId=298939 for more information.', 'distinguishedname': 'CN=Protected Users,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-525'}>>,\n",
       " <Record n=<Node id=102 labels=frozenset({'DomainGroup'}) properties={'name': 'SG_ALL_TIER2_SERVICE_ACCOUNTS@HOT.LOCAL', 'distinguishedname': 'CN=SG_All_Tier2_Service_Accounts,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-1103'}>>,\n",
       " <Record n=<Node id=103 labels=frozenset({'DomainGroup'}) properties={'name': 'DNSUPDATEPROXY@HOT.LOCAL', 'description': 'DNS clients who are permitted to perform dynamic updates on behalf of some other clients (such as DHCP servers).', 'distinguishedname': 'CN=DnsUpdateProxy,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-1102'}>>,\n",
       " <Record n=<Node id=104 labels=frozenset({'DomainGroup'}) properties={'name': 'SG_ALL_TIER0_ACCOUNTS@HOT.LOCAL', 'distinguishedname': 'CN=SG_All_Tier0_Accounts,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-1104'}>>,\n",
       " <Record n=<Node id=105 labels=frozenset({'DomainGroup'}) properties={'name': 'DENIED RODC PASSWORD REPLICATION GROUP@HOT.LOCAL', 'description': 'Members in this group cannot have their passwords replicated to any read-only domain controllers in the domain', 'distinguishedname': 'CN=Denied RODC Password Replication Group,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-572'}>>,\n",
       " <Record n=<Node id=106 labels=frozenset({'DomainGroup'}) properties={'name': 'DNSADMINS@HOT.LOCAL', 'description': 'DNS Administrators Group', 'distinguishedname': 'CN=DnsAdmins,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-1101'}>>,\n",
       " <Record n=<Node id=107 labels=frozenset({'DomainGroup'}) properties={'name': 'ADSYNCADMINS@HOT.LOCAL', 'description': 'ADSyncAdmins', 'distinguishedname': 'CN=ADSyncAdmins,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2103'}>>,\n",
       " <Record n=<Node id=108 labels=frozenset({'DomainGroup'}) properties={'name': 'DOMAIN COMPUTERS@HOT.LOCAL', 'description': 'All workstations and servers joined to the domain', 'distinguishedname': 'CN=Domain Computers,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-515'}>>,\n",
       " <Record n=<Node id=109 labels=frozenset({'DomainGroup'}) properties={'name': 'SG_ALL_TIER2_ACCOUNTS@HOT.LOCAL', 'distinguishedname': 'CN=SG_All_Tier2_Accounts,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-1108'}>>,\n",
       " <Record n=<Node id=110 labels=frozenset({'DomainGroup'}) properties={'name': 'SG_ALL_TIER0_SERVICE_ACCOUNTS@HOT.LOCAL', 'distinguishedname': 'CN=SG_All_Tier0_Service_Accounts,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-1107'}>>,\n",
       " <Record n=<Node id=111 labels=frozenset({'DomainGroup'}) properties={'name': 'RAS AND IAS SERVERS@HOT.LOCAL', 'description': 'Servers in this group can access remote access properties of users', 'distinguishedname': 'CN=RAS and IAS Servers,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-553'}>>,\n",
       " <Record n=<Node id=112 labels=frozenset({'DomainGroup'}) properties={'name': 'PAW_USERS@HOT.LOCAL', 'distinguishedname': 'CN=PAW_Users,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2147'}>>,\n",
       " <Record n=<Node id=113 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-555'}>>,\n",
       " <Record n=<Node id=114 labels=frozenset({'DomainGroup'}) properties={'name': 'ADSYNCOPERATORS@HOT.LOCAL', 'description': 'ADSyncOperators', 'distinguishedname': 'CN=ADSyncOperators,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2104'}>>,\n",
       " <Record n=<Node id=115 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-573'}>>,\n",
       " <Record n=<Node id=116 labels=frozenset({'DomainGroup'}) properties={'name': 'CERT PUBLISHERS@HOT.LOCAL', 'description': 'Members of this group are permitted to publish certificates to the directory', 'distinguishedname': 'CN=Cert Publishers,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-517'}>>,\n",
       " <Record n=<Node id=117 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-576'}>>,\n",
       " <Record n=<Node id=118 labels=frozenset({'DomainGroup'}) properties={'name': 'SG_ALL_TIER0_ACCOUNTSSS@HOT.LOCAL', 'distinguishedname': 'CN=SG_All_Tier0_Accountsss,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2146'}>>,\n",
       " <Record n=<Node id=119 labels=frozenset({'DomainGroup'}) properties={'name': 'SG_ALL_TIER1_ACCOUNTS@HOT.LOCAL', 'distinguishedname': 'CN=SG_All_Tier1_Accounts,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-1105'}>>,\n",
       " <Record n=<Node id=120 labels=frozenset({'DomainGroup'}) properties={'name': 'DOMAIN USERS@HOT.LOCAL', 'description': 'All domain users', 'distinguishedname': 'CN=Domain Users,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-513'}>>,\n",
       " <Record n=<Node id=121 labels=frozenset({'DomainGroup'}) properties={'name': 'ADMINPWPOLICY@HOT.LOCAL', 'distinguishedname': 'CN=AdminPWPolicy,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2143'}>>,\n",
       " <Record n=<Node id=122 labels=frozenset({'DomainGroup'}) properties={'name': 'TIER0@HOT.LOCAL', 'distinguishedname': 'CN=tier0,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-1110'}>>,\n",
       " <Record n=<Node id=123 labels=frozenset({'DomainGroup'}) properties={'name': 'ADSYNCBROWSE@HOT.LOCAL', 'description': 'ADSyncBrowse', 'distinguishedname': 'CN=ADSyncBrowse,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2105'}>>,\n",
       " <Record n=<Node id=124 labels=frozenset({'DomainGroup'}) properties={'name': 'ALLOWED RODC PASSWORD REPLICATION GROUP@HOT.LOCAL', 'description': 'Members in this group can have their passwords replicated to all read-only domain controllers in the domain', 'distinguishedname': 'CN=Allowed RODC Password Replication Group,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-571'}>>,\n",
       " <Record n=<Node id=125 labels=frozenset({'DomainGroup'}) properties={'name': 'SG_ALL_TIER1_SERVICE_ACCOUNTS@HOT.LOCAL', 'distinguishedname': 'CN=SG_All_Tier1_Service_Accounts,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-1106'}>>,\n",
       " <Record n=<Node id=126 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-551'}>>,\n",
       " <Record n=<Node id=127 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-32-562'}>>,\n",
       " <Record n=<Node id=128 labels=frozenset({'DomainGroup'}) properties={'name': 'PAW_USERSS@HOT.LOCAL', 'distinguishedname': 'CN=PAW_Userss,CN=Users,DC=hot,DC=local', 'domain': 'HOT.LOCAL', 'sid': 'S-1-5-21-3712873460-3785406585-1658148875-2145'}>>,\n",
       " <Record n=<Node id=129 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-5-9'}>>,\n",
       " <Record n=<Node id=130 labels=frozenset({'DomainGroup'}) properties={'sid': 'S-1-1-0'}>>]"
      ]
     },
     "execution_count": 99,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = '''MATCH (n) RETURN n'''\n",
    "out = conn.query(query)\n",
    "out"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get domain users and groups which are admin on a host"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record SamAccountName='Domain Users' computer='HOT-JUMPHOST.HOT.LOCAL'>]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = '''\n",
    "MATCH (adminGrp:LocalGroup)\n",
    "WHERE adminGrp.sid = 'S-1-5-32-544'\n",
    "WITH adminGrp\n",
    "MATCH (adminGrp)-[:hasMember*1..]->(x)\n",
    "WHERE x:DomainUser OR x:DomainGroup\n",
    "RETURN DISTINCT x.name AS SamAccountName, adminGrp.computerName AS computer\n",
    "'''\n",
    "out = conn.query(query)\n",
    "out"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
