{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Import libs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pathlib"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create connection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Neo4jConnection:\n",
    "    def __init__(self, uri, user, pwd):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def query(self, query, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try: \n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n",
    "            response = list(session.run(query))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session is not None:\n",
    "                session.close()\n",
    "                \n",
    "        return response\n",
    "conn = Neo4jConnection(uri=\"bolt://localhost:7687\", user=\"neo4j\", pwd=\"vovse\")\n",
    "relpath = pathlib.Path().absolute().as_uri()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Import data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Delete everything in graph\n",
    "query = '''MATCH (n) DETACH DELETE n'''\n",
    "out = conn.query(query)\n",
    "\n",
    "# User data\n",
    "query = '''\n",
    "CALL apoc.load.json('%s/../jsondata/0001-users.json') YIELD value\n",
    "UNWIND value.users AS u\n",
    "MERGE (domainUser:DomainUser {sid:u.SID})\n",
    "SET domainUser += u.Properties\n",
    "''' % relpath\n",
    "out = conn.query(query)\n",
    "\n",
    "# Group data - DC local groups\n",
    "query = '''\n",
    "CALL apoc.load.json('%s/../jsondata/0001-groups.json') YIELD value\n",
    "UNWIND value.groups AS g\n",
    "WITH g WHERE g.type = 'LocalGroup'\n",
    "MERGE (localGroup:LocalGroup {sid:g.SID, computerName:g.Properties.domain})\n",
    "SET localGroup += g.Properties\n",
    "WITH g, localGroup\n",
    "UNWIND g.members AS mb\n",
    "FOREACH (_ IN case when mb.type = 'LocalGroup' then [1] else [] end|\n",
    "\tMERGE (localSubGroup:LocalGroup {sid:mb.SID, computerName:g.Properties.domain})\n",
    "\tMERGE (localGroup)-[:hasMember]->(localSubGroup)\n",
    ")\n",
    "FOREACH (_ IN case when mb.type = 'DomainUser' then [1] else [] end|\n",
    "\tMERGE (domainUser:DomainUser {sid:mb.SID})\n",
    "\tMERGE (localGroup)-[:hasMember]->(domainUser)\n",
    ")\n",
    "FOREACH (_ IN case when mb.type = 'DomainGroup' then [1] else [] end|\n",
    "\tMERGE (domainGroup:DomainGroup {sid:mb.SID})\n",
    "\tMERGE (localGroup)-[:hasMember]->(domainGroup)\n",
    ")\n",
    "''' % relpath\n",
    "out = conn.query(query)\n",
    "\n",
    "# Group data - domain groups\n",
    "query = '''\n",
    "CALL apoc.load.json('%s/../jsondata/0001-groups.json') YIELD value\n",
    "UNWIND value.groups AS g\n",
    "WITH g WHERE g.type = 'DomainGroup'\n",
    "MERGE (domainGroup:DomainGroup {sid:g.SID})\n",
    "SET domainGroup += g.Properties\n",
    "WITH g, domainGroup\n",
    "UNWIND g.members AS mb\n",
    "FOREACH (_ IN case when mb.type = 'LocalGroup' then [1] else [] end|\n",
    "    MERGE (localGroup:LocalGroup {sid:mb.SID, computerName:g.Properties.domain})\n",
    "    MERGE (domainGroup)-[:hasMember]->(localGroup)\n",
    ")\n",
    "FOREACH (_ IN case when mb.type = 'DomainUser' then [1] else [] end|\n",
    "    MERGE (domainUser:DomainUser {sid:mb.SID})\n",
    "    MERGE (domainGroup)-[:hasMember]->(domainUser)\n",
    ")\n",
    "FOREACH (_ IN case when mb.type = 'DomainGroup' then [1] else [] end|\n",
    "    MERGE (domainSubGroup:DomainGroup {sid:mb.SID})\n",
    "    MERGE (domainGroup)-[:hasMember]->(domainSubGroup)\n",
    ")\n",
    "''' % relpath \n",
    "out = conn.query(query)\n",
    "\n",
    "# Computer data\n",
    "query = '''\n",
    "CALL apoc.load.json('%s/../jsondata/0001-computers.json') YIELD value\n",
    "UNWIND value.computers AS c\n",
    "MERGE (computer:Computer {sid:c.SID})\n",
    "SET computer += c.Properties\n",
    "\n",
    "// Local users\n",
    "WITH c, computer\n",
    "UNWIND c.LocalUsers AS lu\n",
    "MERGE (localUser:LocalUser {name:lu.name, sid:lu.SID, computerName:computer.name})\n",
    "MERGE (computer)-[:hasUser]->(localUser)\n",
    "\n",
    "// Local groups\n",
    "WITH c, computer\n",
    "UNWIND c.LocalGroups AS lg\n",
    "MERGE (localGroup:LocalGroup {name:lg.name, sid:lg.SID, computerName:computer.name})\n",
    "MERGE (computer)-[:hasGroup]->(localGroup)\n",
    "\n",
    "// Local group members\n",
    "WITH lg, localGroup, c, computer\n",
    "UNWIND lg.members AS mb\n",
    "FOREACH (_ IN case when mb.type = 'LocalGroup' then [1] else [] end|\n",
    "\tMERGE (localSubGroup:LocalGroup {name:mb.name, sid:mb.SID, computerName:computer.name})\n",
    "\tMERGE (computer)-[:hasGroup]->(localSubGroup)\n",
    "\tMERGE (localGroup)-[:hasMember]->(localSubGroup)\n",
    ")\n",
    "FOREACH (_ IN case when mb.type = 'LocalUser' then [1] else [] end|\n",
    "\tMERGE (localUser:LocalUser {name:mb.name, sid:mb.SID, computerName:computer.name})\n",
    "\tMERGE (computer)-[:hasUser]->(localUser)\n",
    "\tMERGE (localGroup)-[:hasMember]->(localUser)\n",
    ")\n",
    "FOREACH (_ IN case when mb.type = 'DomainUser' then [1] else [] end|\n",
    "\tMERGE (domainUser:DomainUser {sid:mb.SID})\n",
    "\tMERGE (localGroup)-[:hasMember]->(domainUser)\n",
    ")\n",
    "FOREACH (_ IN case when mb.type = 'DomainGroup' then [1] else [] end|\n",
    "\tMERGE (domainGroup:DomainGroup {sid:mb.SID})\n",
    "\tMERGE (localGroup)-[:hasMember]->(domainGroup)\n",
    ")\n",
    "\n",
    "// URA\n",
    "WITH c, computer\n",
    "UNWIND c.URA AS ura\n",
    "FOREACH (principal IN ura.principals |\n",
    "    FOREACH (_ IN case when principal.type = 'LocalGroup' then [1] else [] end|\n",
    "        MERGE (localGroup:LocalGroup {name:principal.name, sid:principal.SID, computerName:computer.name})\n",
    "        MERGE (localGroup)-[:hasRight {name:ura.right}]->(computer)\n",
    "    )\n",
    "    FOREACH (_ IN case when principal.type = 'LocalUser' then [1] else [] end|\n",
    "        MERGE (localUser:LocalUser {name:principal.name, sid:principal.SID, computerName:computer.name})\n",
    "        MERGE (localUser)-[:hasRight {name:ura.right}]->(computer)\n",
    "    )\n",
    "    FOREACH (_ IN case when principal.type = 'DomainUser' then [1] else [] end|\n",
    "        MERGE (domainUser:DomainUser {sid:principal.SID})\n",
    "        MERGE (domainUser)-[:hasRight {name:ura.right}]->(computer)\n",
    "    )\n",
    "    FOREACH (_ IN case when principal.type = 'DomainGroup' then [1] else [] end|\n",
    "        MERGE (domainGroup:DomainGroup {sid:principal.SID})\n",
    "        MERGE (domainGroup)-[:hasRight {name:ura.right}]->(computer)\n",
    "    )\n",
    ")\n",
    "''' % relpath \n",
    "out = conn.query(query)\n",
    "\n",
    "# Container data\n",
    "query = '''\n",
    "CALL apoc.load.json('%s/../jsondata/0001-containers.json') YIELD value\n",
    "UNWIND value.containers AS c\n",
    "CREATE (container:Container {GUID:c.ObjectGUID})\n",
    "SET container += c.Properties\n",
    "WITH c, container\n",
    "UNWIND c.Principals AS principal\n",
    "FOREACH (_ IN case when principal.type = 'LocalUser' then [1] else [] end|\n",
    "\tMERGE (localUser:LocalUser {sid:principal.SID, computerName:c.Properties.domain})\n",
    "\tMERGE (container)-[:contains]->(localUser)\n",
    ")\n",
    "FOREACH (_ IN case when principal.type = 'LocalGroup' then [1] else [] end|\n",
    "\tMERGE (localGroup:LocalGroup {sid:principal.SID, computerName:c.Properties.domain})\n",
    "\tMERGE (container)-[:contains]->(localGroup)\n",
    ")\n",
    "FOREACH (_ IN case when principal.type = 'DomainUser' then [1] else [] end|\n",
    "\tMERGE (domainUser:DomainUser {sid:principal.SID})\n",
    "\tMERGE (container)-[:contains]->(domainUser)\n",
    ")\n",
    "FOREACH (_ IN case when principal.type = 'DomainGroup' then [1] else [] end|\n",
    "\tMERGE (domainGroup:DomainGroup {sid:principal.SID})\n",
    "\tMERGE (container)-[:contains]->(domainGroup)\n",
    ")\n",
    "FOREACH (_ IN case when principal.type = 'Computer' then [1] else [] end|\n",
    "\tMERGE (computer:Computer {sid:principal.SID})\n",
    "\tMERGE (container)-[:contains]->(computer)\n",
    ")\n",
    "''' % relpath\n",
    "out = conn.query(query)\n",
    "\n",
    "# Connect DC groups to DCs\n",
    "query = '''\n",
    "MATCH (dc:Computer) WHERE dc.PrimaryGroupSid ENDS WITH '-516'\n",
    "WITH dc\n",
    "MATCH (dcGroup:LocalGroup) WHERE dcGroup.domain = dc.domain\n",
    "MERGE (dc)-[:hasGroup]->(dcGroup)\n",
    "'''\n",
    "out = conn.query(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get all data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = '''MATCH (n) RETURN n'''\n",
    "out = conn.query(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get domain users and groups which are admin on a host"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record SamAccountName='Domain Users' computer='HOT-JUMPHOST.HOT.LOCAL'>]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = '''\n",
    "MATCH (adminGrp:LocalGroup)\n",
    "WHERE adminGrp.sid = 'S-1-5-32-544'\n",
    "WITH adminGrp\n",
    "MATCH (adminGrp)-[:hasMember*1..]->(x)\n",
    "WHERE x:DomainUser OR x:DomainGroup\n",
    "RETURN DISTINCT x.name AS SamAccountName, adminGrp.computerName AS computer\n",
    "'''\n",
    "out = conn.query(query)\n",
    "out"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
